In [2]:
import pandas as pd
import awswrangler as wr

In [3]:
df_uso_cartoes = wr.s3.read_parquet('s3://neon-datascience-sandbox/churn-cartoes/uso_cartoes')
df_uso_cartoes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35721396 entries, 0 to 35721395
Data columns (total 3 columns):
 #   Column           Dtype
---  ------           -----
 0   clientid         Int64
 1   convertedvalue   float64
 2   transactiondate  string
dtypes: Int64(1), float64(1), string(1)
memory usage: 851.7 MB

In [4]:
df_uso_cartoes.head(3)

   clientid  convertedvalue transactiondate
0   2395260           63.61      2023-06-05
1  12717494           35.16      2023-06-05
2   5271752           49.32      2023-06-05

In [5]:
df_uso_cartoes.groupby('clientid').agg({
    
    'convertedvalue':'mean',
    'transactiondate':'count'

})

          convertedvalue  transactiondate
clientid
57            735.123925              186
59             42.249231               13
96             93.015526               38
98             22.743571               14
106            18.476667                6
...                  ...              ...
24739526      400.000000                1
24739582      101.666667                3
24739666        4.490000                1
24739683       18.490000                1
24739799        4.200000                2

[2371183 rows x 2 columns]